Repository: mariasev26/20930087H
Catalog: omegat/project_save.tmx
Source language: en_gb
Languages: es_es

source: Adjusted Score: 44837%
es_es: Puntuación general: 44837%

source: Adjusted Score: 45600%
es_es: Puntuación general: 45600%

source: Adjusted Score: 50595%
es_es: Puntuación general : 50595%

source: Adjusted Score: 50926%
es_es: Puntuación general: 50926%

source: Adjusted Score: 54495%
es_es: Puntuación general: 54495%

source: Adjusted Score: 54769%
es_es: Puntuación general: 54769%

source: Adjusted Score: 5671%
es_es: Puntuación general: 5671%

source: Adjusted Score: 64049%
es_es: Puntuación general: 64049%

source: Adjusted Score: 65050%
es_es: Puntuación general: 65050%

source: Adjusted Score: 70474%
es_es: Puntuación general: 70474%

source: Adjusted Score: 72489%
es_es: Puntuación general: 72489%

source: Adjusted Score: 76118%
es_es: Puntuación general: 76118%

source: Adjusted Score: 76489%
es_es: Puntuación general: 76489%

source: Adjusted Score: 77655%
es_es: Puntuación general: 77655%

source: Adjusted Score: 77896%
es_es: Puntuación general: 77896%

source: Adjusted Score: 80111%
es_es: Puntuación general: 80111%

source: Adjusted Score: 82239%
es_es: Puntuación general: 82239%

source: Adjusted Score: 83065%
es_es: Puntuación general: 83065%

source: Adjusted Score: 86536%
es_es: Puntuación general: 86536%

source: Adjusted Score: 90276%
es_es: Puntuación general: 90276%

source: Adjusted Score: 95341%
es_es: Puntuación general: 95341%

source: Adjusted Score: 97580%
es_es: Puntuación 97580%

source: Critics Consensus: Blood has a handful of solid scares, but a narrative that fails to truly coagulate makes this half-empty vial of vampire horror difficult to recommend.
es_es: Consenso de la crítica: Blood tiene un puñado de sustos sólidos, pero una narrativa que no consigue coagular de verdad hace que este frasco medio vacío de terror vampírico sea difícil de recomendar.

source: Critics Consensus: Skinamarink can be more confounding than frightening, but for viewers able or willing to dial into its unique wavelength, this unsettling film will be difficult to shake.
es_es: Consenso de la crítica: Skinamarink puede ser más desconcertante que aterradora, pero para los espectadores capaces o dispuestos a marcar en su longitud de onda única, esta película inquietante será difícil de sacudir.

source: Critics Consensus: The Outwaters may strike some viewers as frustratingly withholding, but it remains an ambitious -- and overall effective -- slice of found-footage horror.
es_es: Consenso de la crítica: The Outwaters puede resultar frustrante para algunos espectadores, pero sigue siendo una ambiciosa -y en general eficaz- película de terror.

source: Critics Consensus: Unwelcome's tonal and pacing issues prevent this rural horror outing from reaching its full potential, but it's still frequently fun.
es_es: Consenso de la crítica: Los problemas tonales y de ritmo de Unwelcome impiden que esta salida de terror rural alcance todo su potencial, pero sigue siendo divertida con frecuencia.

source: Critics Consensus: We Have a Ghost has a fun concept and a talented cast; unfortunately, this spookily uneven '80s pastiche also has very little idea of what to do with them.
es_es: Consenso de la crítica: Tenemos un fantasma tiene un concepto divertido y un reparto con talento; por desgracia, este pastiche ochentero espeluznantemente desigual también tiene muy poca idea de qué hacer con ellos.

source: Critics Consensus: A bone-chilling body horror, Huesera offers genre fans a twisted take on What to Expect When You're Expecting.
es_es: Críticas generales: Un terror que te cala los huesos, Huesera ofrece a los fans de este género un giro de la película Qué Esperar Cuando Estás Esperando.

source: Critics Consensus: A possession thriller that knows the devil's in the details, Attachment scares some fresh angles out of a well-worn horror subgenre.
es_es: Criticas generales: Una obra de suspense que hace que conozcamos al demonio con todos los detalles, Attachment tiene unos detalles que asustan a pesar de ser un subgénero de terror bastante usado.

source: Critics Consensus: Although it fails to take full advantage of its committed stars and killer premise, Renfield's batty horror-comedy blend sinks in just enough to leave an impression.
es_es: Consenso de la crítica: Aunque no consigue sacar todo el partido a sus comprometidas estrellas y a su premisa asesina, la batalladora mezcla de terror y comedia de Renfield se hunde lo suficiente como para dejar huella.

source: Critics Consensus: Although it's often less than scary and parts of the story don't bear scrutiny, Knock at the Cabin is a thought-provoking chiller and upper-tier Shyamalan.
es_es: Consenso de la crítica: Aunque a menudo da menos miedo y algunas partes de la historia no soportan el escrutinio, Knock at the Cabin es un chiller que invita a la reflexión y un Shyamalan de nivel superior.

source: Critics Consensus: Although its second half is difficult to digest, Swallowed is an admirably unusual -- and overall effective -- mixture of body horror and romance.
es_es: Consenso de la crítica: Aunque su segunda mitad es difícil de digerir, Swallowed es una mezcla admirablemente inusual -y en general efectiva- de horror corporal y romance.

source: Critics Consensus: Bereft of a single kernel of fear or excitement, this Children of the Corn suggests the franchise is irrevocably lost in a maize of sub-mediocrity.
es_es: Consenso de la crítica: Desprovista de un solo núcleo de miedo o emoción, esta Children of the Corn sugiere que la franquicia está irrevocablemente perdida en un maíz de sub-mediocridad.

source: Critics Consensus: Conceptually strong but uneven in execution, There's Something Wrong with the Children is a serviceable horror movie that could have been much more.
es_es: Consenso de la crítica: Conceptualmente fuerte pero desigual en la ejecución, Hay algo malo en los niños es una película de terror servicial que podría haber sido mucho más.

source: Critics Consensus: Despite being blessed with Jena Malone in the lead, Consecration serves up Catholic-themed horror that's far more hoary than hallowed.
es_es: Consenso de la crítica: A pesar de ser bendecida con Jena Malone en el papel principal, Consagración sirve horror de temática católica que es mucho más anticuado que santificado.

source: Critics Consensus: Dominus Crowe!
es_es: Consenso de la crítica: ¡Dominus Crowe!

source: Critics Consensus: No consensus yet.
es_es: Críticas generales: Todavía no se ha llegado a un acuerdo.

source: Critics Consensus: Oh, bother.
es_es: Consenso de la crítica: Qué fastidio.

source: Critics Consensus: Unapologetically silly and all the more entertaining for it, M3GAN is the rare horror-comedy that delivers chuckles as effortlessly as chills.
es_es: Criticas generales: Una película tan llena de estupideces que hace que sea entretenida, M3GAN es una rara comedia de terror que provoca tanto carcajadas como escalofrios sin ningún esfuerzo.

source: Critics Consensus: Within the outline of its fairly standard story, The Offering puts a unique -- and often genuinely scary -- spin on demonic possession horror tropes.
es_es: Críticas generales: En los límites de las típicas películas de hadas, The Offering da un giro único, además de terrorífico, a la temática de posesiones demoníacas.

source: Directed By: Adrian Langley
es_es: Dirigida por: Adrian Langley

source: Directed By: Alessandro Antonaci, Daniel Lascar, Stefano Mandalà
es_es: Dirigida por: Alessandro Antonaci, Daniel Lascar, Stefano Mandalà

source: Directed By: Alexis Jacknow
es_es: Dirigida por: Alexis Jacknow

source: Directed By: Barry Jay
es_es: Dirigida por: Barry Jay

source: Directed By: Beth Hanna, Jerren Lauder
es_es: Dirigida por: Beth Hanna, Jerren Lauder

source: Directed By: Brad Anderson
es_es: Dirigida por: Brad Anderson

source: Directed By: Brendan Rudnicki
es_es: Dirigida por: Brendan Rudnicki

source: Directed By: Carlos Therón
es_es: Dirigida por: Carlos Therón

source: Directed By: Carter Smith
es_es: Dirigida por: Carter Smith

source: Directed By: Cary Solomon, Chuck Konzelman
es_es: Dirigida por: Cary Solomon, Chuck Konzelman

source: Directed By: Chris Cheeseman
es_es: Dirigida por: Chris Cheeseman

source: Directed By: Chris McKay
es_es: Dirigida por: Chris McKay

source: Directed By: Christopher Landon
es_es: Dirigida por: Christopher Landon

source: Directed By: Christopher Smith
es_es: Dirigida por: Christopher Smith

source: Directed By: Corey Deshon
es_es: Dirigida por: Corey Deshon

source: Directed By: Deon Taylor
es_es: Dirigida por: Deon Taylor

source: Directed By: Erik Bloomquist
es_es: Dirigida por: Erik Bloomquist

source: Directed By: Gabriel Bier Gislason
es_es: Dirigida por: Gabriel Bier Gislason

source: Directed By: Gerard Johnstone
es_es: Dirigida por: Gerard Johnstone

source: Directed By: Greg Swinson, Ryan Thiessen
es_es: Dirigida por: Greg Swinson, Ryan Thiessen

source: Directed By: Jacob Byrd
es_es: Dirigida por: Jacob Byrd

source: Directed By: James Cullen Bressack
es_es: Dirigida por: James Cullen Bressack

source: Directed By: Jeff Ryan
es_es: Dirigida por: Jeff Ryan

source: Directed By: Jeffrey A. Brown
es_es: Dirigida por: Jeffrey A. Brown

source: Directed By: Jon Wright
es_es: Dirigida por: Jon Wright

source: Directed By: Julius Avery
es_es: Dirigida por: Julius Avery

source: Directed By: Kurt Wimmer
es_es: Dirigida por: Kurt Wimmer

source: Directed By: Kyle Edward Ball
es_es: Dirigida por: Kyle Edward Ball

source: Directed By: M. Night Shyamalan
es_es: Dirigida por: M. Night Shyamalan

source: Directed By: Marcus Harben
es_es: Dirigida por: Marcus Harben

source: Directed By: Mercedes Bryce Morgan
es_es: Dirigida por: Mercedes Bryce Morgan

source: Directed By: Michelle Garza
es_es: Dirigida por: Michelle Garza

source: Directed By: Nathan Crooker, Carlos Goitia, David M Night Maire, Mia Kate Russell
es_es: Dirigida por: Nathan Crooker, Carlos Goitia, David M Night Maire, Mia Kate Russell

source: Directed By: Nathan Frankowski
es_es: Dirigida por: Nathan Frankowski

source: Directed By: Oliver Park
es_es: Dirigida por: Oliver Park

source: Directed By: Patrick Rea
es_es: Dirigida por: Patrick Rea

source: Directed By: Rhys Frake-Waterfield
es_es: Dirigida por: Rhys Frake-Waterfield

source: Directed By: Robbie Banfitch
es_es: Dirigida por: Robbie Banfitch

source: Directed By: Roxanne Benjamin
es_es: Dirigida por: Roxanne Benjamin

source: Directed By: Scott Walker
es_es: Dirigida por: Scott Walker

source: Directed By: Steve Johnson
es_es: Dirigida por: Steve Johnson

source: Directed By: Stig Svendsen
es_es: Dirigida por: Stig Svendsen

source: Directed By: Wayne David
es_es: Dirigida por: Wayne David

source: Directed By: Wesley Taylor, Alex Wyse
es_es: Dirigida por: Wesley Taylor, Alex Wyse

source: Directed By: Yoko Okumura
es_es: Dirigida por: Yoko Okumura

source: More RT25 Anniversary Content:
es_es: Más RT25 Contenido del Aniversario:

source: Starring: Alice Orr-Ewing, Joe Doyle, Eveline Hall, Peter Mensah
es_es: Reparto: Alice Orr-Ewing, Joe Doyle, Eveline Hall, Peter Mensah

source: Starring: Alisha Wainwright, Zach Gilford, Amanda Crew, Carlos Santos
es_es: Reparto: Alisha Wainwright, Zach Gilford, Amanda Crew, Carlos Santos

source: Starring: Allison Williams, Violet McGraw, Ronny Chieng, Brian Jordan Alvarez
es_es: Reparto: Allison Williams, Violet McGraw, Ronny Chieng, Brian Jordan Alvarez

source: Starring: Cara Buono, William Sadler, Clare Foley, Spencer List
es_es: Reparto: Cara Buono, William Sadler, Clare Foley, Spencer List

source: Starring: Casper Van Dien, Elyse Dinh, Vivien Ngô, Ian Alexander
es_es: Reparto: Casper Van Dien, Elyse Dinh, Vivien Ngô, Ian Alexander

source: Starring: Chloë Marie Rhoades, Tyler Miller, Benjamin L. Newmark, Stephanie Kirves
es_es: Reparto: Chloë Marie Rhoades, Tyler Miller, Benjamin L. Newmark, Stephanie Kirves

source: Starring: Craig David Dowsett, Chris Cordell, Amber Doig-Thorne, Natasha Tosini
es_es: Reparto: Craig David Dowsett, Chris Cordell, Amber Doig-Thorne, Natasha Tosini

source: Starring: Dave Bautista, Jonathan Groff, Ben Aldridge, Nikki Amuka-Bird
es_es: Reparto: Dave Bautista, Jonathan Groff, Ben Aldridge, Nikki Amuka-Bird

source: Starring: David Harbour, Jahi Di'Allo Winston, Anthony Mackie, Erica Ash
es_es: Reparto: David Harbour, Jahi Di'Allo Winston, Anthony Mackie, Erica Ash

source: Starring: Dianna Agron, Melora Hardin, Jay Ali, Saul Rubinek
es_es: Reparto: Dianna Agron, Melora Hardin, Jay Ali, Saul Rubinek

source: Starring: Elena Kampouris, Kate Moyer, Callan Mulvey, Bruce Spence
es_es: Reparto: Elena Kampouris, Kate Moyer, Callan Mulvey, Bruce Spence

source: Starring: Elli Rhiannon Müller Osborne, Liv Mjönes, Arthur Hakalahti, Sjur Vatne Brean
es_es: Reparto: Elli Rhiannon Müller Osborne, Liv Mjönes, Arthur Hakalahti, Sjur Vatne Brean

source: Starring: Hannah John-Kamen, Douglas Booth, Colm Meaney, Jamie-Lee O'Donnell
es_es: Reparto: Hannah John-Kamen, Douglas Booth, Colm Meaney, Jamie-Lee O'Donnell

source: Starring: Harry Jarvis, Loreece Harrison, Nina Wadia, Erin Austen
es_es: Reparto: Harry Jarvis, Loreece Harrison, Nina Wadia, Erin Austen

source: Starring: Jena Malone, Cooper Koch, Jose Colon, Mark Patton
es_es: Reparto: Jena Malone, Cooper Koch, Jose Colon, Mark Patton

source: Starring: Jena Malone, Danny Huston, Ian Pirie, Janet Suzman
es_es: Reparto: Jena Malone, Danny Huston, Ian Pirie, Janet Suzman

source: Starring: Joseph Sikora, King Bach, Annie Ilonzeh, Ruby Modine
es_es: Reparto: Joseph Sikora, King Bach, Annie Ilonzeh, Ruby Modine

source: Starring: Kristos Andrews, Galadriel Stineman, Maurice LaMarche, Charles M. Howell IV
es_es: Reparto: Kristos Andrews, Galadriel Stineman, Maurice LaMarche, Charles M. Howell IV

source: Starring: Lachlan Watson, Michele Hicks, Shunori Ramanathan, Brendan Meyer
es_es: Reparto: Lachlan Watson, Michele Hicks, Shunori Ramanathan, Brendan Meyer

source: Starring: Lucas Paul, Dali Rose Tetreault, Ross Paul, Jaime Hill
es_es: Reparto: Lucas Paul, Dali Rose Tetreault, Ross Paul, Jaime Hill

source: Starring: Lucia Caporaso, Daniele De Martino, Rocco Marazzita, Chiara Casolari
es_es: Reparto: Lucia Caporaso, Daniele De Martino, Rocco Marazzita, Chiara Casolari

source: Starring: Luciane Buchanan, Matt Whelan, Zara Nausbaum, Regina Hegemann
es_es: Reparto: Luciane Buchanan, Matt Whelan, Zara Nausbaum, Regina Hegemann

source: Starring: Luke Baines, Kayla Radomski, Sean Cullen, Roger Clark
es_es: Reparto: Luke Baines, Kayla Radomski, Sean Cullen, Roger Clark

source: Starring: McKaley Miller, Dermot Mulroney, Anne Heche, Brice Anthony Heller
es_es: Reparto: McKaley Miller, Dermot Mulroney, Anne Heche, Brice Anthony Heller

source: Starring: Michelle Monaghan, Skeet Ulrich, Finlay Wojtak-Hissong, June B. Wilde
es_es: Reparto: Michelle Monaghan, Skeet Ulrich, Finlay Wojtak-Hissong, June B. Wilde

source: Starring: Midori Francis, Jolene Purdy, Missi Pyle, Michael Patrick Lane
es_es: Reparto: Midori Francis, Jolene Purdy, Missi Pyle, Michael Patrick Lane

source: Starring: Morgan Saylor, Myko Olivier, Danilo Crovetti, Keith Powell
es_es: Reparto: Morgan Saylor, Myko Olivier, Danilo Crovetti, Keith Powell

source: Starring: Natalia Solián, Alfonso Dosal, Mayra Batalla, Mercedes Hernández
es_es: Reparto: Natalia Solián, Alfonso Dosal, Mayra Batalla, Mercedes Hernández

source: Starring: Natalie Terrazzino, JC Oakley III, Larry Bunton, Trevor Tucker
es_es: Reparto: Natalie Terrazzino, JC Oakley III, Larry Bunton, Trevor Tucker

source: Starring: Nick Blood, Emm Wiseman, Allan Corduner, Paul Kaye
es_es: Reparto: Nick Blood, Emm Wiseman, Allan Corduner, Paul Kaye

source: Starring: Nicolas Cage, Nicholas Hoult, Awkwafina, Ben Schwartz
es_es: Reparto: Nicolas Cage, Nicholas Hoult, Awkwafina, Ben Schwartz

source: Starring: Paula Brasca, Tom Vaughan-Lawlor, Pooya Mohseni, Christopher Kirby
es_es: Reparto: Paula Brasca, Tom Vaughan-Lawlor, Pooya Mohseni, Christopher Kirby

source: Starring: Robbie Banfitch, Angela Basolis, Michelle May, Scott Schamell
es_es: Reparto: Robbie Banfitch, Angela Basolis, Michelle May, Scott Schamell

source: Starring: Russell Crowe, Daniel Zovatto, Alex Essoe, Franco Nero
es_es: Reparto: Russell Crowe, Daniel Zovatto, Alex Essoe, Franco Nero

source: Starring: Sarah McGuire, Laurie Catherine Winkel, Paige Maria, Patrick McGee
es_es: Reparto: Sarah McGuire, Laurie Catherine Winkel, Paige Maria, Patrick McGee

source: Starring: Sean Patrick Flanery, Jordan Belfi, Tom Ohmer, James Healy Jr.
es_es: Reparto: Sean Patrick Flanery, Jordan Belfi, Tom Ohmer, James Healy Jr.

source: Starring: Sherri Shepherd, Mike C. Manning, Jonny Beauchamp, Ashleigh Murray
es_es: Reparto: Sherri Shepherd, Mike C. Manning, Jonny Beauchamp, Ashleigh Murray

source: Starring: Sofie Gråbøl, Josephine Park, Ellie Kendrick, David Dencik
es_es: Reparto: Sofie Gråbøl, Josephine Park, Ellie Kendrick, David Dencik

source: Starring: Sophie Skelton, Stuart Brennan, Bret "The Hitman" Hart
es_es: Reparto: Sophie Skelton, Stuart Brennan, Bret "The Hitman" Hart

source: Starring: Steff Ivory Conover, Mischa O'Hoski, Paul Krysinski, Ryan Brown
es_es: Reparto: Steff Ivory Conover, Mischa O'Hoski, Paul Krysinski, Ryan Brown

source: Starring: Sydney Carvill, Wade Baker, Janet Carter, Bob Shuster
es_es: Reparto: Sydney Carvill, Wade Baker, Janet Carter, Bob Shuster

source: Starring: Toni Acosta, Fran Cantos, Andrea Gara, Emilio Gutiérrez Caba
es_es: Reparto: Toni Acosta, Fran Cantos, Andrea Gara, Emilio Gutiérrez Caba

source: Starring: Travis Coles, Michael Urie, Frankie Grande, Nicholas Logan
es_es: Reparto: Travis Coles, Michael Urie, Frankie Grande, Nicholas Logan

source: Starring: Wayne David, Sian Altman, Grant Masters, Jake Wood
es_es: Reparto: Wayne David, Sian Altman, Grant Masters, Jake Wood

source: Starring: Will Martin, Will Madden, Michelle Veintimilla, Maria Decotis
es_es: Reparto: Will Martin, Will Madden, Michelle Veintimilla, Maria Decotis

source: Synopsis: "Clock" is the story of a woman who enrolls in a clinical trial to try and fix her seemingly broken... [More]
es_es: Sinopsis: "Clock" es la historia de una mujer que se inscribe en un ensayo clínico para tratar de arreglar su... [Más]

source: Synopsis: "You're Killing Me" follows Eden Murphy (McKaley Miller), who goes to a coveted 'Heaven and Hell' party, hoping to get... [More]
es_es: Sinopsis: "You're Killing Me" sigue a Eden Murphy (McKaley Miller), que acude a una codiciada fiesta 'Heaven and Hell', con la esperanza de conseguir... [Más]

source: Synopsis: A disturbed babysitter experiences a sexual awakening while using LSD to treat a seemingly sick child from a family with... [More]
es_es: Sinopsis: Una perturbada niñera experimenta un despertar sexual mientras usa LSD para tratar a un niño aparentemente enfermo de una familia con... [Más]

source: Synopsis: A gay bachelor party takes a spooky turn when sinister spirits are suddenly summoned.
es_es: Sinopsis:Una despedida de soltero de una pareja homosexual toma un giro escalofriante cuando siniestros espíritus son convocados inesperadamente.

source: Synopsis: A man who has gone into isolated hiding is haunted by visions of the woman he loves and a mysterious... [More]
es_es: Sinopsis: Un hombre que ha pasado a la clandestinidad aislado es perseguido por visiones de la mujer que ama y por un misterioso... [Más]

source: Synopsis: A modern horror creature feature, UNWELCOME shows us just how far we will go to protect those we love.
es_es: Sinopsis: UNWELCOME, una moderna película de terror, nos muestra hasta dónde somos capaces de llegar para proteger a nuestros seres queridos.

source: Synopsis: A powerful biotech company has breakthrough technology allowing them to clone history's most influential people with just a few fragments... [More]
es_es: Sinopsis: Una poderosa empresa de biotecnología dispone de una tecnología revolucionaria que le permite clonar a las personas más influyentes de la historia con solo unos fragmentos... [Más]

source: Synopsis: A year into living through a worldwide pandemic, a group of friends gather in the remote Tahoe Mountains, to stay... [More]
es_es: Sinopsis: Un año después de vivir una pandemia mundial, un grupo de amigos se reúne en las remotas montañas de Tahoe... [Más]

source: Synopsis: A young woman is kidnapped and inducted into a bizarre family as their new surrogate daughter.
es_es: Sinopsis: Una joven es secuestrada e introducida en una extraña familia como su nueva hija nacida por gestación subrogada.

source: Synopsis: ADALYNN follows a mother fighting postpartum depression and slipping over the edge.
es_es: Sinopsis: ADALYNN sigue a una madre que lucha contra la depresión posparto y se desliza hacia el límite.

source: Synopsis: ATTACHMENT is a horror romance about Maja, a has-been actress in Denmark, who falls in love with Leah, a young,... [More]
es_es: Sinopsis: ATTACHMENT es un romance de terror sobre Maja, un intento de actriz de Dinamarca, que se enamora de Leah, una joven... [Más]

source: Synopsis: After a drug run goes bad, two friends must survive a nightmarish ordeal of drugs, bugs and horrific intimacy.... [More]
es_es: Sinopsis: Después de que un asunto de drogas salga mal, dos amigos deben sobrevivir a una pesadilla de drogas, bichos y horrorosa intimidad....

source: Synopsis: After mysteriously inheriting an abandoned coastal property, Ben and his family accidentally unleash an ancient, long-dormant creature that terrorized the... [More]
es_es: Sinopsis: Tras heredar misteriosamente una propiedad costera abandonada, Ben y su familia liberan accidentalmente a una antigua criatura dormida durante mucho tiempo que aterrorizaba a los... [Más]

source: Synopsis: After undergoing an experimental procedure to restore her damaged hearing, 20-year-old Chloe Grayden (Lachlan Watson, "Chilling Adventures of Sabrina") begins... [More]
es_es: Sinopsis: Después de someterse a un procedimiento experimental para restaurar su audición dañada, Chloe Grayden (Lachlan Watson, "Las escalofriantes aventuras de Sabrina"), de 20 años, comienza... [Más]

source: Synopsis: After witnessing a grotesque murder at a party in her new town, a teenager starts having strange visions and bizarre... [More]
es_es: Sinopsis: Después de presenciar un grotesco asesinato en una fiesta en su nueva ciudad, una adolescente empieza a tener extrañas visiones y extrañas... [Más]

source: Synopsis: Alex is an aspiring singer/songwriter, a drug addict who's been damaged from childhood abuse.
es_es: Sinopsis: Alex es un aspirante a cantante y compositor, drogadicto y dañado por los abusos de su infancia.

source: Synopsis: Amy, a young woman is on the run with her young son Adrian from her abusive ex-girlfriend.
es_es: Sinopsis:Amy es una mujer joven que está escapando con su hijo pequeño Adrián de su ex-pareja abusiva.

source: Synopsis: As friends settle down in their remote cabin for a relaxing weekend, a creature prowls outside, waiting to strike.
es_es: Sinopsis: Cuando unos amigos están asentándose en una cabaña remota para pasar un fin de semana relajante, una criatura aparece fuera, esperando para atacar.

source: Synopsis: Candy is a late-night radio DJ with a program where people call to tell her real horror stories.
es_es: Sinopsis: Candy es una DJ de radio nocturna con un programa en el que la gente llama para contarle historias reales de terror.

source: Synopsis: Finding a ghost named Ernest haunting their new home turns Kevin's family into overnight social media sensations.
es_es: Sinopsis: Encontrar a un fantasma llamado Ernest rondando su nueva casa convierte a la familia de Kevin en una sensación en las redes sociales de la noche a la mañana.
